{
  "course_id": "TOkt1105",
  "title": "Probability theory",
  "overview": "This course provides knowledge on probability theory for economics, specifically for the fields of economic mathematics and statistics. It uses mathematical tools to measure, study random phenomena, approach uncertain realities, and calculate probabilities to support decision-making. Random phenomena are described, quantified, and analyzed through random events, random variables, probability distributions, characteristic parameters, and characteristic functions. The theoretical basis is rigorously proven, and examples are designed to relate to economic and financial practices, linking to evaluation and decision-making problems. It serves as a foundation for subsequent specialized courses such as Mathematical Statistics, Econometrics, and Multivariate Statistics. Probability theory is also the basis for random simulation fields, applied in financial mathematics and quantitative research. The course uses Microsoft Excel and the R language for practical calculations.",
  "difficulty_level": "Beginner",
  "duration": {
    "total_hours": 150,
    "credits": 3
  },
  "knowledge_graph_alignment": {
    "primary_domain": "Mathematics",
    "sub_domains": [
      "Probability theory",
      "Economic mathematics",
      "Statistics"
    ],
    "key_concepts": [
      "Random events",
      "Probability",
      "Random variables",
      "Probability distributions",
      "Characteristic parameters",
      "Characteristic functions"
    ]
  },
  "skill_outcomes": [
    {
      "skill_name": "Measure and calculate the probability of random events",
      "category": "Tool/Software",
      "target_proficiency_level": 3,
      "bloom_taxonomy_level": "Evaluate",
      "outcome_description": "Understand the concept of randomness in phenomena and measure randomness"
    },
    {
      "skill_name": "Explain the concepts of random variables and probability distributions",
      "category": "Tool/Software",
      "target_proficiency_level": 3,
      "bloom_taxonomy_level": "Analyze",
      "outcome_description": "Differentiate and relate the functions of one-dimensional and multi-dimensional random variables"
    },
    {
      "skill_name": "Describe random phenomena, calculate probabilities and characteristic parameters in specific economic and financial situations",
      "category": "Tool/Software",
      "target_proficiency_level": 3,
      "bloom_taxonomy_level": "Apply",
      "outcome_description": "Use software and the R language to support calculations and random simulations"
    },
    {
      "skill_name": "Self-study and actively seek to understand, study, and solve practical problems",
      "category": "Soft Skill",
      "target_proficiency_level": 3,
      "bloom_taxonomy_level": "Create",
      "outcome_description": "Be proactive in learning and researching situations and solving practical problems"
    }
  ],
  "pedagogy_format": {
    "theory_percentage": 50,
    "practice_percentage": 50,
    "has_project": false
  },
  "entry_requirements": {
    "prerequisite_courses": [
      "None"
    ],
    "minimum_entry_skills": []
  }
}